IDEA Connection Link
ConnectionSrv Methods
The ConnectionSrv type exposes the following members.
Methods
Name | Description
CalculateProject
 CalculateProject
CloseServices
 CloseServices
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetConnectionModel
 GetConnectionModel
GetConnectionModelDesktop
 GetConnectionModelDesktop
GetConnectionResultsData
 GetConnectionResultsData
GetDetailedConResultsData
 Get detailed results of checks
GetDetailedConResultsJSON
 Get detailed results of checks inJSOM
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetNonconformities
 Get all nonconformities for connection
GetResultFile
 GetResultFile
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetWeldStress
 Weld curve for weld ID and connection
GetWeldUid
 Weld id from connection model
ImportFromIOM(Byte[])
 ImportFromIOM
ImportFromIOM(OpenModel, OpenModelResult)
 ImportFromIOM
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
OpenConnectionService
 Open connection project from data contract
OpenIdeaConProjectFile
 OpenIdeaConProjectFile
OpenIdeaConProjectFileAndResultFile
 OpenIdeaConProjectFileAndResultFile
ReadFully
 ReadFully
SaveIdeaConToProjectFile
 SaveIdeaConToProjectFile
SaveResultToFile
 SaveResultToFile
SetAndOpenIdeaConProjectFile
 OpenIdeaConProjectFile
SetAndOpenIdeaConProjectFileAndResultFile
 OpenIdeaConProjectFileAndResultFile
StreamToByteArray
 StreamToByteArray
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace